/*
 Вычислите суммарную массу имеющих форму прямоугольного параллелепипеда блоков одинаковой плотности, но разного размера.

 Указание

 Считайте, что размеры блоков измеряются в сантиметрах, плотность — в граммах на кубический сантиметр, а итоговая масса — в граммах.
 Таким образом, массу блока можно вычислять как простое произведение плотности на объём.

 Формат ввода

 В первой строке вводятся два целых положительных числа: количество блоков N и плотность каждого блока R.
 Каждая из следующих N строк содержит три целых положительных числа W, H, D — размеры очередного блока.

 Гарантируется, что:

 количество блоков N не превосходит 10^5;
 плотность блоков R не превосходит 100;
 размеры блоков W, H, D не превосходят 10^4.

 Пример

 Ввод

 2 14
 1 2 3
 30 40 50

 Вывод

 840084

 */

#include <iostream>
#include <vector>
#include <cstdint>

using namespace std;

int main() {

	uint64_t mass = 0, r = 0, w = 0, h = 0, d = 0;
	size_t n = 0;
	cin >> n >> r;

	for (size_t i = 0; i < n; i++) {
		cin >> w >> h >> d;
		mass += (w * h * d * r);
	}

	cout << mass;

	return 0;
}
